[
  "How do you feel about long walks on the beach?",
  "What is your favorite type of music?",
  "What do you like to do on a first date?",
  "What is your go-to conversation starter?",
  "If you had to take a date to dinner, where would you go?",
  "If you could have a superpower, what would it be and why?",
  
  "Given the choice of anyone in the world, whom would you want as a dinner guest?",
  "Would you like to be famous? In what way?",
  "Before making a telephone call, do you ever rehearse what you are going to say and why?",
  "What would constitute a \"perfect\" day for you?",
  "When did you last sing to yourself? To someone else?",
  "If you were able to live to the age of 90 and retain either the mind or body of a 30-year-old for the last 60 years of your life, which would you want and why?",
  "For what in your life do you feel most grateful?",
  "If you could change anything about the way you were raised, what would it be?",
  "If you could wake up tomorrow having gained any one quality or ability, what would it be?",
  "If a crystal ball could tell you the truth about yourself, your life, the future or any one thing, what would you want to know?",
  "Is there something that you've dreamed of doing for a long time? Why haven't you done it?",
  "What is the greatest accomplishment of your life?",
  "What do you value most in a friendship?",
  "What is your most treasured memory?",
  "What is your most terrible memory?",
  "If you knew that in one year you would die suddenly, would you change anything about the way you are now living and why?",
  "When did you last cry in front of another person? By yourself?",
  "What, if anything, is too serious to be joked about?",
  "If you were to die this evening with no opportunity to communicate with anyone, what would you most regret not having told someone? Why haven't you told them yet?",
  "Your house, containing everything you own, catches fire. After saving your loved ones and pets, you have time to safely make a final dash to save any one item. What would it be and why?",
  "What is the most important thing your close friends should know about you?",
  "What is one of your most embarrassing moments?",

  "Complete the sentence \"I wish I had someone with whom I could share...\"",
  "Do you have a secret hunch about how you will die?",
  "How do you feel about your relationship with your mother?",
  "What does friendship mean to you?",
  "What roles do love and affection play in your life?",
  "How close and warm is your family? Do you feel your childhood was happier than most other people's?",
  "Of all the people in your family, whose death would you find most disturbing? Why?"
]
